{
  "rag_uploads/005e541861d972be09f464e62dd33dccNTPC_Metrics.pdf": "The document outlines a strategic framework for optimizing NTPC's coal supply chain using eight Key Performance Indicators (KPIs) to enhance efficiency, reliability, and cost-effectiveness. Prepared on September 16, 2025, it emphasizes transitioning from reactive logistics to proactive, data-driven decision-making. The KPIs are categorized into four groups:\n\n1. **Core Logistical KPIs**: Measure efficiency in time, cost, and material integrity (e.g., On-Time Flag, Delay Minutes, Rs/t-km, Shrinkage %).\n2. **Diagnostic & Contextual KPIs**: Identify reasons for performance deviations (e.g., Weather-Attributed Delay, Grade Mix Entropy).\n3. **Predictive & Strategic KPIs**: Evaluate long-term partner and pathway performance (e.g., Supplier Reliability, Route Risk Score).\n4. **Integrated Insights**: Combine KPIs for a holistic \"Control Tower\" view.\n\nThe framework aims to reduce costs, improve operational predictability, mitigate risks, and enhance partner performance. It includes an implementation roadmap with phases for data foundation, KPI implementation, and integration into business processes. The goal is to foster continuous improvement and data-driven excellence in NTPC's coal logistics network.",
  "rag_uploads/445e4b976a5d6ee8d7f6a2ed12120721NTPC_Operations_Knowledge_Document.pdf": "The NTPC Fuel Stock Norms Policy (Coal) Version 1.0 outlines guidelines for managing coal stock at NTPC coal-fired stations. It includes methods for calculating, monitoring, and responding to stock levels to ensure safe operations. Key components include:\n\n1. **Purpose & Scope**: The policy aims to measure stock levels, flag risks, and recommend supply routes using AI tools. It covers domestic and blended coal flows via various transport modes.\n\n2. **Key Definitions**:\n   - **Safe Stock (Days)**: Usable coal inventory in days based on daily burn rate.\n   - **Policy Minimum/Target**: Minimum and target stock levels to avoid operational risks.\n   - **Projected Stock (T+X)**: Forecasted stock days ahead.\n   - **Landed Cost**: Total delivered coal cost per ton.\n   - **Risk Score**: Logistics risk score for routes.\n   - **DFCC-enabled Route**: Routes using Dedicated Freight Corridors for reliability.\n\n3. **Stock Norms by Plant Category**: Defines stock norms based on plant location and sourcing patterns, with adjustments for seasonal disruptions.\n\n4. **Projection & Measurement Method**: Details inputs, confidence levels, and formulas for projecting stock levels and identifying risks.\n\n5. **Monitoring Cadence & Dashboards**: Daily updates and dashboards for stock levels, with heatmaps and route panels for flagged plants.\n\n6. **Trigger Bands & Escalation**: Defines actions based on stock level conditions",
  "rag_uploads/8bd5da6373641134703d3091dad561ebNTPC_Detailed_Corporate_Report.pdf": "NTPC Limited, a Maharatna Public Sector Undertaking, is India's largest power generator, with an installed capacity exceeding 83 GW, representing 17.4% of India's total capacity. It generates nearly 25% of the nation's electricity, showcasing high efficiency. Financially, NTPC reported a consolidated operating income of ₹188,138 crore and a net profit of ₹23,422 crore for the fiscal year ending March 2025. The company is expanding its coal-based capacity by 30 GW and aims for 60 GW of renewable energy by 2032. Established in 1975, NTPC evolved from a thermal power entity to an integrated energy conglomerate, achieving Maharatna status in May 2010. Its vision includes leading India's energy transition, with a mission focused on reliable, economical, and environmentally friendly power solutions. Core values include integrity, customer focus, and innovation.",
  "rag_uploads/d23dd3607426b3f69b7cf5f5fb67c106NTPC_Operations_Knowledge_Document_1.pdf": "The NTPC Operations Knowledge Document outlines essential guidelines and best practices for managing the coal supply chain to ensure reliable and cost-effective operations at NTPC power plants. Key definitions include:\n\n- **Underperformance**: When suppliers or logistics routes fail to meet agreed KPIs, such as delivering less than 90% on-time or supplying only 85% of scheduled coal.\n- **Risk Score**: A 0-10 scale assessing the risk of supply disruption based on factors like route length, transport mode, weather, infrastructure, and historical reliability. Scores of 8-10 indicate high-risk routes.\n- **Route Optimization**: Selecting efficient and reliable transport paths to minimize costs and transit time while managing risks.\n- **Lead Time**: The transit time from mine to plant, crucial for evaluating route performance.\n- **Landed Coal Cost**: Total cost of coal delivered to the plant, including logistics, with strategies to reduce it focusing on route optimization and operational efficiency.\n- **Loading Efficiency**: Measures the effectiveness of loading/unloading operations, with lower efficiency indicating delays.\n\nOperational guidelines emphasize maintaining adequate coal stock (15-17 days for pithead plants, 20-30 days for non-pithead), conducting regular supplier performance reviews, and using data-driven decisions to optimize logistics and reduce costs.",
  "rag_uploads/d2865e9abb031ee73883d017aa508687NTPC_Limited__Comprehensive_Business_Report.pdf": "NTPC Limited, founded in 1975, is India's largest integrated power generator, primarily owned by the Government of India (51.1% equity). As of 2025, NTPC has over 83 GW group capacity, including 55.2 GW from 27 coal-fired stations. The company aims to expand to 130–149 GW by 2032, maintaining a 65–70% coal share. NTPC's coal operations include 37 plants totaling ~64,200 MW, with major stations like Vindhyachal and Rihand. In FY24, NTPC's coal generation reached ~362 billion kWh with a PLF of ~77%. NTPC sources coal domestically and imports from Indonesia, aiming for 25% self-sourced coal by 2030. Key suppliers include BHEL, L&T, and GE, with a focus on high-efficiency, low-emission technologies."
}